In [2]:
import pandas as pd
import numpy as np

# DataFrame
* Object that is a tabular, spreadsheet-like data structure
* containing collection of columns
* DataFrame is stored in mememory as a collection of Series

In [46]:
cars = {'make': ['Ford', 'Hyundai', 'Toyota', 'Tesla'],
       'model': ['Taurus', 'Accord', 'Camry', 'Model_S'],
       'MSRP' : [27595, 23570, 23495, 68000]} #dictionary
carData = pd.DataFrame(cars)
carData
#한 column 당 Series 라고 볼 수 있음

      make    model   MSRP
0     Ford   Taurus  27595
1  Hyundai   Accord  23570
2   Toyota    Camry  23495
3    Tesla  Model_S  68000

In [47]:
cars2 = pd.DataFrame(cars, index = [1,2,3,4]) #change index
cars2

      make    model   MSRP
1     Ford   Taurus  27595
2  Hyundai   Accord  23570
3   Toyota    Camry  23495
4    Tesla  Model_S  68000

In [48]:
cars2['year'] = [2018,2019,2020,2021]
cars2

      make    model   MSRP  year
1     Ford   Taurus  27595  2018
2  Hyundai   Accord  23570  2019
3   Toyota    Camry  23495  2020
4    Tesla  Model_S  68000  2021

In [49]:
cars2['year'] = 2018
cars2

      make    model   MSRP  year
1     Ford   Taurus  27595  2018
2  Hyundai   Accord  23570  2018
3   Toyota    Camry  23495  2018
4    Tesla  Model_S  68000  2018

### DataFrame from list of tuples

In [50]:
tuple_list = [(2011,45.1,32.4), (2012,42.4,34.5),(2013,47.2,39.2),(2014,44.2,31.4),(2015,39.9,29.8),(2016,41.5,36.7)]
column_names = ['year', 'temp', 'precip']

weatherData = pd.DataFrame(tuple_list, columns=column_names)
weatherData

   year  temp  precip
0  2011  45.1    32.4
1  2012  42.4    34.5
2  2013  47.2    39.2
3  2014  44.2    31.4
4  2015  39.9    29.8
5  2016  41.5    36.7

* max
* mean
* std

In [51]:
weatherData['temp'].max()

47.2

In [52]:
weatherData['year'].mean()

2013.5

In [53]:
weatherData['precip'].std()

3.5082759298550066

### DataFrame from numpy ndarray

In [93]:
npdata = np.random.randn(5,3)
columnNames = ['x1', 'x2', 'x3']
data = pd.DataFrame(npdata, columns = columnNames)
data

         x1        x2        x3
0 -0.407511  0.191692  2.265013
1  0.908528 -0.106482  2.372202
2  2.006173 -0.174020  0.240286
3  0.243953  0.372736 -0.101416
4  0.570018  1.183592 -0.533115

In [94]:
data.iloc[0:2, 0]

0   -0.407511
1    0.908528
Name: x1, dtype: float64

In [95]:
data.iloc[0::2]

         x1        x2        x3
0 -0.407511  0.191692  2.265013
2  2.006173 -0.174020  0.240286
4  0.570018  1.183592 -0.533115

In [96]:
data.iloc[3]

x1    0.243953
x2    0.372736
x3   -0.101416
Name: 3, dtype: float64

In [97]:
carData[carData.MSRP > 25000]

    make    model   MSRP
0   Ford   Taurus  27595
3  Tesla  Model_S  68000

### Arithmetic Operations

In [98]:
data

         x1        x2        x3
0 -0.407511  0.191692  2.265013
1  0.908528 -0.106482  2.372202
2  2.006173 -0.174020  0.240286
3  0.243953  0.372736 -0.101416
4  0.570018  1.183592 -0.533115

In [99]:
print("Transpose")
data.T

Transpose

           0         1         2         3         4
x1 -0.407511  0.908528  2.006173  0.243953  0.570018
x2  0.191692 -0.106482 -0.174020  0.372736  1.183592
x3  2.265013  2.372202  0.240286 -0.101416 -0.533115

In [100]:
print("Addition")
print(data + 4)

Addition
         x1        x2        x3
0  3.592489  4.191692  6.265013
1  4.908528  3.893518  6.372202
2  6.006173  3.825980  4.240286
3  4.243953  4.372736  3.898584
4  4.570018  5.183592  3.466885

In [101]:
print("Multiplication")
data*10

Multiplication

          x1         x2         x3
0  -4.075108   1.916921  22.650126
1   9.085280  -1.064817  23.722015
2  20.061732  -1.740195   2.402857
3   2.439532   3.727356  -1.014155
4   5.700176  11.835921  -5.331149

In [102]:
columnNames = ['x1','x2','x3']
data2 = pd.DataFrame(np.random.randn(5,3), columns=columnNames)
data2

         x1        x2        x3
0  1.013593  0.360914  0.406904
1 -0.630954  0.862917 -0.319578
2 -0.120375 -1.415332 -0.640889
3 -0.299535  0.422226 -0.858269
4  0.155587  0.257761 -1.001618

In [103]:
data+data2

         x1        x2        x3
0  0.606082  0.552607  2.671916
1  0.277574  0.756435  2.052624
2  1.885798 -1.589352 -0.400604
3 -0.055582  0.794962 -0.959685
4  0.725605  1.441353 -1.534733

In [104]:
data * data2

         x1        x2        x3
0 -0.413050  0.069184  0.921642
1 -0.573239 -0.091885 -0.758103
2 -0.241493  0.246295 -0.153997
3 -0.073072  0.157379  0.087042
4  0.088687  0.305083  0.533978

In [108]:
data.mul(data2)

         x1        x2        x3
0 -0.413050  0.069184  0.921642
1 -0.573239 -0.091885 -0.758103
2 -0.241493  0.246295 -0.153997
3 -0.073072  0.157379  0.087042
4  0.088687  0.305083  0.533978

In [109]:
data.div(data2)

          x1        x2        x3
0  -0.402046  0.531129  5.566457
1  -1.439928 -0.123397 -7.422922
2 -16.666049  0.122953 -0.374925
3  -0.814440  0.882786  0.118163
4   3.663653  4.591827  0.532254

column 값이 동일하지 않을 때

In [106]:
data3 = columnNames = ['y1','y2','y3']
data3 = pd.DataFrame(np.random.randn(5,3), columns=columnNames)
data3

         y1        y2        y3
0  0.184738  0.788074 -0.947835
1  0.395076 -1.917253 -0.030697
2 -0.201415 -0.338006 -0.592927
3 -1.175674  0.301024 -0.869372
4 -1.248174 -0.081940  2.495525

In [110]:
data+data3

   x1  x2  x3  y1  y2  y3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN
4 NaN NaN NaN NaN NaN NaN

* abs()
* max()
* min()
* sum()
* mean()

In [111]:
data.abs()

         x1        x2        x3
0  0.407511  0.191692  2.265013
1  0.908528  0.106482  2.372202
2  2.006173  0.174020  0.240286
3  0.243953  0.372736  0.101416
4  0.570018  1.183592  0.533115

In [114]:
data.max() #max value for each column

x1    2.006173
x2    1.183592
x3    2.372202
dtype: float64

In [116]:
data.min()

x1   -0.407511
x2   -0.174020
x3   -0.533115
dtype: float64

In [118]:
data.min(axis=1) #min value for each row

0   -0.407511
1   -0.106482
2   -0.174020
3   -0.101416
4   -0.533115
dtype: float64

In [119]:
data.sum()

x1    3.321161
x2    1.467519
x3    4.242969
dtype: float64

In [120]:
data.sum(axis=1)

0    2.049194
1    3.174248
2    2.072439
3    0.515273
4    1.220495
dtype: float64

In [121]:
data.sum().sum()

9.031649288024866

In [124]:
data.mean()

x1    0.664232
x2    0.293504
x3    0.848594
dtype: float64

In [125]:
data.mean(axis=1)

0    0.683065
1    1.058083
2    0.690813
3    0.171758
4    0.406832
dtype: float64

### pandas with lambda

In [130]:
f = lambda x: x.max() - x.min()
print(data.apply(f))
print()
print(data.apply(f, axis=1))

x1    2.413684
x2    1.357612
x3    2.905316
dtype: float64

0    2.672523
1    2.478683
2    2.180193
3    0.474151
4    1.716707
dtype: float64